import React from "react";
import { Link } from "react-router-dom";

const Main = () =>{

    return(
        <main>
        <div id="portfolio" className="portfolio">
            <h2>Портфоліо</h2>
        </div>
        <div className="port-next">
            <div className="plot">
            <p>Освіта вища Колесник, Вінницький політехнічний інститут за спеціальністю «Електронно-обчислювальні машини».</p>
            <p>В 1986 році Колесник А. І. успішно закінчив  навчання на  курсах з вивчення нових поколінь ЕОМ  в Московському інституті електронної техніки Міністерства електронної промисловості СРСР.</p>
            <p>В 1986 році викладач Колесник А. І. увійшов до складу науково-методичної комісії з питань інформатизації середніх спеціальних навчальних закладів Міністерства  вищої та середньої спеціальної освіти СРСР   Як член комісії приймав  активну  участь в наукових конференціях, виставках, семінарах, олімпіадах, наданні методичної допомоги  навчальним закладам різних регіонів СРСР з питань інформатизації освіти.</p>
            <p>В 1989 році учні технікуму під керівництвом викладача Колесника А. І. в пасажирському вагоні привезли з Москви 4 перших ІВМ-подібних компютери польського виробництва - “Мазовія” з чорно-білими моніторами типу «Геркулес». Це були перші ІВМ-подібні компютери  в  навчальних закладах області, навіть у вищих навчальних закладах на той час таких ПЕОМ ще не було. З ентузіазмом взявся за   проведення інформатизації навчального процесу, розробку навчально-методичного забезпечення для ефективного використання нової обчислювальної техніки в підготовці кваліфікованих спеціалістів.</p>
            <p>З 1993 року  призначений на посаду заступника директора з навчальної роботи Вінницького технікуму електронних приладів. З ініціативи Анатолія Івановича та під його  безпосереднім керівництвом вперше в Україні  розроблені та затверджені стандарти для підготовки молодших спеціалістів за спеціальністю  5.092213 «Обслуговування і ремонт електроустаткування автомобілів і тракторів». Розроблені також стандарти зі спеціальності 5.090805 «Конструювання, виробництво і технічне обслуговування виробів електронної техніки». В 1995 році розроблені та затверджені необхідні документи для входження технікуму в нуково-методичний комплекс Київського політехнічного інституту. Завдяки створенню цього комплексу, технікум  електронних приладів за результатами акредитації, проведеної Міністерством освіти і науки, був перетворений у Вінницький технічний коледж.</p>
            <p> Під керівництвом Колесника А. І. в 1995-1998 роках ліцензовані в коледжі нові спеціальності: 5.092213 «Обслуговування і ремонт електроустаткування автомобілів і тракторів», 5.050113 «Комерційна діяльність», 5.050104 «Фінанси», 5.050107 «Економіка підприємства», 5.090704 «Конструювання, виробництво та технічне обслуговування радіотехнічних пристроїв»</p>
            <p>З 2004 року - голова випускової циклової комісії інформатики та інформаційних комп’ютерних  технологій, голова обласного методичного обєднання викладачів інформатики та обчислювальної техніки вищих навчальних закладів I-II рівнів акредитації Вінницької області. Поширює серед викладачів області інноваційні ідеї, нестандартні форми проведення навчальних занять, методи використання нових інформаційно-комунікаційних технологій в навчальному процесі. Має багато наукових праць і публікацій у науково-методичних виданнях і фахових часописах.</p>
            <p>Очолив розробку ОПП спеціальності, 5.05010201 «Обслуговування комп’ютерних систем і мереж» розробку навчального плану, навчальних програм.</p>
            <p>Зусиллями Колесника А.І. у 2010-11 навчальному році  спільно з Інститутом інформаційних технологій та комп’ютерної інженерії Вінницького національного технічного університету були розроблені інтегровані навчальні плани за якими наші випускники спеціальності  5.05010201 «Обслуговування комп’ютерних систем і мереж» отримують освітньо–кваліфікаційний рівень бакалавра за два роки. За три роки продовжили навчання у ВНТУ за скороченим терміном навчання  більше 1000 наших випускників.</p>
            <p>Розробив положення для проведення внутрішньої та обласної олімпіади з інформатики та щорічно організовує їх проведення. Щорічно приймає активну участь в підготовці учасників обласних та всеукраїнських олімпіад з інформатики. Підготував чотирьох переможців Обласної олімпіади  з інформатики та  двох призерів Всеукраїнської.</p>
            <p>Викладачі випускової  циклової комісії «Інформатики та інформаційних комунікаційних технологій», яку очолює  Колесник А. І. щорічно представляють на обласну виставку технічної творчості  серед ВНЗ І-ІІ рівнів акредитації більше 100 експонатів  За результатами обласних виставок технічної творчості 2009 - 2018 років, були відмічені  дипломами роботи студентів , виконані під керівництвом  Колесника А.І. </p>
            <p>Експерт з акредитації спеціальностей галузей знань 0501 Інформатика та обчислювальна техніка та Інформаційні технології, Міністерства освіти і науки з 2010 року. </p>
            <p>З метою покращення підготовки студентів спеціальності «Обслуговування комп’ютерних систем і мереж» для потреб ІТ-компаній з 2014 року, ввів у ОПП спеціальності дисципліну Практика з програмування та КП з програмування. А з 2018 року була з цією метою введена ще дисципліна Розробка та тестування програмного забезпечення.</p>
            <p>Автор проекту Лабораторія інновацій  Вінницького технічного коледжу «TechSpace» на здобуття гранту Вінницької обласної Ради та Вінницької обласної державної адміністрації, який посів перше місце серед ВНЗ 1-2 рівнів акредитації області.</p>
            <p>В результаті плідної роботи з Гамбурзьким інститутом систематики створення цінностей і управління знаннями(HIWW) 22.02.2023р. організував поповнення ФабЛаб ВФТК сучасним верстатом з числовим програмним керуванням та сучасним  3D-принтером. З метою ефективного використання цих сучасних девайсів в навчанні та творчості студентів, протягом 10 днів були організовані  Воркшопи для студентів та викладачів від HIWW(Німеччина) та толокарів (Україна). Саме такі сучасні інструменти в поєднанні з персональними комп’ютерами дають можливість нашим студентам  стати сучасними, затребуваними  комп’ютерними інженерами. </p>
            <p>Голова підкомісії з розробки Державного стандарту фахової передвищої освіти України освітньо-професійного ступеня фахового молодшого бакалавра спеціальності 123 Комп’ютерна інженерія галузі знань 12 Інформаційні технології. Стандарт затверджено наказом Міністерства освіти і науки України від  20.04.2022р. №366.</p>
            <p>Очолює Академію CISCO  ВТК.В результаті тісної співпраці з українськими представництвами всесвітньо відомої компанії мережевого обладнання CISCO, лабораторія комп’ютерних мереж поповнилась маршрутизаторами, комутаторами та іншим  обладнанням CISCO. В 2024 році розроблений прототип реальної комп’ютерної мережі Це дасть можливість формувати компетентності студентів спеціальності комп’ютерна інженерія, використовуючи реальні мережеві пристрої від світового лідера сучасних мережевих систем компанії CISCO.</p>
            <p>Володіє іноземними мовами та застосовує її в професійній діяльності</p>
            <p>За успіхи в навчально-виховній роботі Колесник А.І. має багато подяк, почесних грамоти від адміністрації навчального закладу,  почесних грамот Ради директорів ВЗО 1-2 рівнів акредитації Вінницької області, подяки від  відділу навчальних закладів Міністерства електронної промисловості СРСР, Почесну грамоту Державного Комітету по народній освіті СРСР, Почесні грамоти Міністерства освіти і науки України, Почесні грамоти Вінницької обласної державної адміністрації,  Почесну грамоту  управління освіти і науки Вінницької обласної  державної адміністрації.</p>
            <p>Нагороджений нагрудним знаком «Відмінник освіти України», Нагру́дним знаком «Васи́ль Сухомли́нський</p>
            </div>
        </div>
        <div>
            <div className="discipline">
                <h2>Дисципліна - Комп’ютерні мережі</h2>
            </div>
            
            <div className="works d-flex flex-column">
            <div className="d-flex">
            <div className="lect-card">
        <div className="lect-text">
            <h2>Лекції</h2>
        </div>
        <Link to="/lectures">Більше</Link>

    </div>
    </div>
    <div className="d-flex">
    <div className="lect-card">
        <div className="lect-text">
            <h2>Лабораторні роботи</h2>
        </div>
        <Link to="/labworks">Більше</Link>

    </div>
    </div>
            </div>
            <div className="push"></div>
        </div>
        <div className="push"></div>
    </main>
    )
}

export default Main;